{
    "personalInfo": {
        "name": "Dipam Poudel",
        "title": "Software Engineer",
        "location": "Queens, NY, 11377",
        "phone": "9296220922",
        "email": "dipampoudel1998@gmail.com",
        "linkedin": "in/dipam-poudel"
    },
    "professionalSummary": "Versatile Front-End Developer with 3+ years of experience building and optimizing scalable web applications across healthcare, e-commerce, and enterprise platforms. Proficient in ReactJS, JavaScript, TypeScript, and Redux, with a strong focus on creating responsive, accessible, and user-centric interfaces. Skilled in modern UI frameworks like Material UI, Ant Design, and Bootstrap, and experienced in back-end integration using Node.js, ExpressJS, and RESTful APIs. Adept in DevOps tools such as Docker, Git, and Heroku, with hands-on experience deploying applications via AWS and managing CI/CD workflows. Strong background in working with SQL and NoSQL databases, including MongoDB, Firebase, and SQL Server, with proven ability to design secure, scalable data flows. Passionate about clean code, agile collaboration, and continuously evolving with technologies like Next.js and Tailwind CSS to deliver high-performing, maintainable products.",
    "experience": [
        {
            "company": "Nimble Clinical Research",
            "location": "New Jersey (Remote)",
            "title": "Software Developer",
            "startDate": "Jan 2022",
            "endDate": "Jan 2023",
            "responsibilities": [
                "Redesigned and optimized the Nimble Clinical application using ReactJS and Redux, resulting in a 400ms reduction in system load time.",
                "Enhanced team productivity by streamlining task coordination and integrating Zoho APIs for workflow automation.",
                "Developed and customized responsive Shopify themes using Liquid, HTML, and CSS, aligning with branding and performance standards.",
                "Implemented data visualizations and interactive UI components using Material UI, Bootstrap, GraphQL, and REST APIs to improve user engagement."
            ],
            "technologies": [
                "ReactJS",
                "Redux",
                "JavaScript",
                "Liquid",
                "Zoho API",
                "GraphQL",
                "REST APIs",
                "Material UI",
                "Bootstrap"
            ]
        },
        {
            "company": "Pegotec Pte. Ltd",
            "location": "Singapore City",
            "title": "Web Developer",
            "startDate": "Dec 2020",
            "endDate": "Jan 2022",
            "responsibilities": [
                "Built and deployed 5+ commercial-grade websites using React, Redux, Node.js, and MongoDB, emphasizing performance and maintainability.",
                "Modernized and maintained legacy systems with ReactJS class components, ensuring system compatibility and long-term support.",
                "Developed interactive admin dashboards featuring real-time map updates and live data streams for dynamic client monitoring.",
                "Led Docker-based deployments and managed AWS environments, ensuring seamless CI/CD and uptime.",
                "Boosted query performance by 25% through integration of SQL Server and query optimization techniques."
            ],
            "technologies": [
                "ReactJS",
                "Redux",
                "Node.js",
                "MongoDB",
                "SQL Server",
                "AWS",
                "Docker",
                "Ant Design"
            ]
        },
        {
            "company": "PrismaSofts",
            "location": "Kathmandu, Nepal",
            "title": "Full Stack Developer",
            "startDate": "Dec 2019",
            "endDate": "Nov 2020",
            "responsibilities": [
                "Built dynamic web apps with ReactJS, Node.js, and Firebase, including custom REST APIs and user authentication systems.",
                "Designed flexible WordPress sites with PHP-backed dashboards for easy content management.",
                "Managed Git-based project workflows, resolving merge conflicts and supporting multi-branch collaboration.",
                "Created optimized SQL schemas and streamlined database operations, increasing data retrieval performance by 30%."
            ],
            "technologies": [
                "ReactJS",
                "Node.js",
                "Firebase",
                "WordPress",
                "PHP",
                "SQL",
                "Git"
            ]
        }
    ],
    "education": [
        {
            "university": "Monroe University",
            "location": "New York",
            "graduationDate": "Aug 2024",
            "degree": "Masters in Computer Science",
            "gpa": "3.92"
        },
        {
            "university": "Tribhuvan University",
            "location": "Kathmandu",
            "graduationDate": "Oct 2020",
            "degree": "Bachelors in Computer Science",
            "percentage": "73%"
        }
    ],
    "certifications": [
        {
            "name": "Object-Oriented Programming with Java – Part 1",
            "issuer": "University of Helsinki",
            "date": "September 12, 2019"
        },
        {
            "name": "Object-Oriented Programming with Java – Part 2",
            "issuer": "University of Helsinki",
            "date": "October 17, 2019"
        }
    ],
    "projects": [
        {
            "name": "Lodgenest",
            "url": "https://lodgenest.netlify.app/",
            "description": [
                "Developed a web-based property management platform for seamless apartment search and bookings (ReactJS, TypeScript, NodeJS, AntDesign, Axios).",
                "Built secure user authentication and role-based access control.",
                "Implemented a real-time messaging system, and designed database schemas and use cases."
            ]
        }
    ],
    "skills": {
        "frontEnd": [
            {
                "skill": "ReactJS",
                "description": "A JavaScript library for building user interfaces.",
                "usage": "Developed and maintained responsive, accessible web applications and commercial-grade websites."
            },
            {
                "skill": "JavaScript",
                "description": "A high-level programming language that is one of the core technologies of the World Wide Web.",
                "usage": "Used across roles for front-end development and creating interactive UI components."
            },
            {
                "skill": "TypeScript",
                "description": "A strict syntactical superset of JavaScript that adds optional static typing.",
                "usage": "Built property management platform and maintained web applications."
            },
            {
                "skill": "Redux",
                "description": "A predictable state container for JavaScript apps.",
                "usage": "Used for state management in applications ensuring consistent data flow."
            },
            {
                "skill": "HTML5",
                "description": "The standard markup language for documents designed to be displayed in a web browser."
            },
            {
                "skill": "CSS3",
                "description": "A stylesheet language used for describing the presentation of a document written in a markup language like HTML."
            },
            {
                "skill": "Material UI",
                "description": "A popular React UI framework that implements Google's Material Design.",
                "usage": "Implemented data visualizations and interactive UI components."
            },
            {
                "skill": "Ant Design",
                "description": "A React UI library with a set of high-quality components and demos for building rich, interactive user interfaces.",
                "usage": "Used for property management platform and interactive admin dashboards."
            },
            {
                "skill": "Bootstrap",
                "description": "A popular CSS framework directed at responsive, mobile-first front-end web development.",
                "usage": "Ensured responsive design and implemented UI components."
            }
        ],
        "backEnd": [
            {
                "skill": "Node.js",
                "description": "A back-end JavaScript runtime environment that runs on the V8 engine and executes JavaScript code outside a web browser.",
                "usage": "Built and deployed websites and developed REST APIs."
            },
            {
                "skill": "ExpressJS",
                "description": "A back-end web application framework for Node.js, designed for building web applications and APIs."
            },
            {
                "skill": "REST APIs",
                "description": "An architectural style for providing standards between computer systems on the web.",
                "usage": "Integrated for real-time data delivery and built custom APIs."
            },
            {
                "skill": "Firebase",
                "description": "A platform developed by Google for creating mobile and web applications.",
                "usage": "Built dynamic apps including authentication systems."
            },
            {
                "skill": "MongoDB",
                "description": "A source-available cross-platform document-oriented database program.",
                "usage": "Used as database for commercial-grade websites."
            },
            {
                "skill": "SQL",
                "description": "A standard language for storing, manipulating and retrieving data in databases.",
                "usage": "Optimized schemas and boosted query performance."
            },
            {
                "skill": "GraphQL",
                "description": "A query language for APIs and a runtime for fulfilling those queries with your existing data.",
                "usage": "Implemented for interactive UI components."
            }
        ],
        "devOpsAndTools": [
            {
                "skill": "Git (GitHub, GitLab)",
                "description": "A distributed version control system for tracking changes in source code during software development.",
                "usage": "Managed workflows, resolved conflicts, and supported collaboration."
            },
            {
                "skill": "Docker",
                "description": "A set of platform as a service products that use OS-level virtualization to deliver software in packages called containers.",
                "usage": "Led deployments and managed environments."
            },
            {
                "skill": "Heroku",
                "description": "A cloud platform as a service supporting several programming languages."
            },
            {
                "skill": "AWS",
                "description": "A subsidiary of Amazon providing on-demand cloud computing platforms and APIs.",
                "usage": "Managed environments ensuring CI/CD and uptime."
            },
            {
                "skill": "Zoho",
                "description": "A suite of business management software and SaaS applications.",
                "usage": "Integrated APIs for workflow automation."
            },
            {
                "skill": "Shopify",
                "description": "An e-commerce platform for online stores and retail point-of-sale systems.",
                "usage": "Developed and customized responsive themes."
            },
            {
                "skill": "Jira",
                "description": "A proprietary issue tracking product developed by Atlassian that allows bug tracking and agile project management."
            }
        ],
        "other": [
            {
                "skill": "UI/UX Design (Figma)",
                "description": "The process of designing user interfaces for machines and software, with a focus on maximizing usability and the user experience."
            },
            {
                "skill": "WordPress",
                "description": "A free and open-source content management system.",
                "usage": "Designed flexible sites with PHP-backed dashboards."
            },
            {
                "skill": "Liquid",
                "description": "An open-source template language created by Shopify and written in Ruby.",
                "usage": "Customized Shopify themes."
            },
            {
                "skill": "CI/CD pipelines",
                "description": "A series of steps that must be performed in order to deliver a new version of software.",
                "usage": "Managed AWS environments ensuring seamless delivery."
            },
            {
                "skill": "Agile/Scrum",
                "description": "A framework for project management that emphasizes teamwork, accountability and iterative progress toward a well-defined goal."
            }
        ]
    }
}
